{
    "plates": [
      {
        "name": "BURRITOS",
        "headline": "Wrapped with freshness",
        "image": "./Assets/burritos.jpg",
        "description": "Hearty, hand-rolled, and packed with flavor. Each burrito is filled with a balanced blend of rice, beans, creamy guacamole, and your choice of meat—wrapped up warm and ready to fuel your day."
      },
      {
        "name": "TORTAS",
        "headline": "Mexican-style sandwiches",
        "image": "./Assets/tortas.jpg",
        "description": "Our tortas are built on toasted, golden bolillo rolls layered with creamy guacamole, your choice of juicy, slow-cooked meat, and topped with crisp cabbage and house-pickled onions. Every bite hits that perfect balance of rich, tangy, and fresh—comfort food with serious flavor."
      },
      {
        "name": "PLATES",
        "headline": "Hearty Plates",
        "image": "./Assets/plates.jpg",
        "description": "Our plates come loaded with your choice of tender, seasoned meat, served alongside hearty beans and rice. Each order includes three fresh, handmade tortillas and a crisp topping of shredded cabbage, pickled onions, and fresh cilantro for the perfect bite of flavor and balance."
      },
      {
        "name": "QUESADILLAS",
        "headline": "Melted to perfection",
        "image": "./Assets/quesadillas.png",
        "description": "Craving something simple and satisfying? Our quesadillas are grilled to golden perfection, packed with your choice of flavorful meats and stuffed with melted cheese. Served with a fresh green salad on the side—it’s the kind of balance you didn’t know you needed."
      },
      {
        "name": "SPECIALTIES",
        "headline": "Seasonal Dishes",
        "image": "./Assets/specialties.jpg",
        "description": "We’re always cooking up something new. Each of our three food trucks offers its own specialty, like our crowd-favorite birria egg rolls. These seasonal creations rotate regularly, so there’s always something fresh and exciting to try. With us, it never gets boring."

      }
    ]
  }